ankuns/nrfx/bsp/stable/mdk/nrf7140_dppr_peripherals.h
#define PDM130_EASYDMA5 0                            /*!< (unspecified)                                                        */
#define PDM130_EASYDMATEMP 1                         /*!< (unspecified)                                                        */
#define PDM130_SAMPLE16 0                            /*!< (unspecified)                                                        */
#define PDM130_SAMPLE48 1                            /*!< (unspecified)                                                        */
#define PDM130_EASYDMALISTINCLUDED 0                 /*!< (unspecified)                                                        */
#define PDM130_EASYDMAMODEINCLUDED 0                 /*!< (unspecified)                                                        */
#define PDM130_EASYDMAFULLLPMODEINCLUDED 0           /*!< (unspecified)                                                        */
#define PDM130_EASYDMAPATTERNMATCHERINCLUDED 0       /*!< (unspecified)                                                        */
#define PDM130_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                   */
#define PDM130_EASYDMASTOPTASKINCLUDED 1             /*!< (unspecified)                                                        */

#define PDM131_EASYDMA5 0                            /*!< (unspecified)                                                        */
#define PDM131_EASYDMATEMP 1                         /*!< (unspecified)                                                        */
#define PDM131_SAMPLE16 0                            /*!< (unspecified)                                                        */
#define PDM131_SAMPLE48 1                            /*!< (unspecified)                                                        */
#define PDM131_EASYDMALISTINCLUDED 0                 /*!< (unspecified)                                                        */
#define PDM131_EASYDMAMODEINCLUDED 0                 /*!< (unspecified)                                                        */
#define PDM131_EASYDMAFULLLPMODEINCLUDED 0           /*!< (unspecified)                                                        */
#define PDM131_EASYDMAPATTERNMATCHERINCLUDED 0       /*!< (unspecified)                                                        */
#define PDM131_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                   */
#define PDM131_EASYDMASTOPTASKINCLUDED 1             /*!< (unspecified)                                                        */

#define PDM132_EASYDMA5 0                            /*!< (unspecified)                                                        */
#define PDM132_EASYDMATEMP 1                         /*!< (unspecified)                                                        */
#define PDM132_SAMPLE16 0                            /*!< (unspecified)                                                        */
#define PDM132_SAMPLE48 1                            /*!< (unspecified)                                                        */
#define PDM132_EASYDMALISTINCLUDED 0                 /*!< (unspecified)                                                        */
#define PDM132_EASYDMAMODEINCLUDED 0                 /*!< (unspecified)                                                        */
#define PDM132_EASYDMAFULLLPMODEINCLUDED 0           /*!< (unspecified)                                                        */
#define PDM132_EASYDMAPATTERNMATCHERINCLUDED 0       /*!< (unspecified)                                                        */
#define PDM132_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                   */
#define PDM132_EASYDMASTOPTASKINCLUDED 1             /*!< (unspecified)                                                        */

#define PDM133_EASYDMA5 0                            /*!< (unspecified)                                                        */
#define PDM133_EASYDMATEMP 1                         /*!< (unspecified)                                                        */
#define PDM133_SAMPLE16 0                            /*!< (unspecified)                                                        */
#define PDM133_SAMPLE48 1                            /*!< (unspecified)                                                        */
#define PDM133_EASYDMALISTINCLUDED 0                 /*!< (unspecified)                                                        */
#define PDM133_EASYDMAMODEINCLUDED 0                 /*!< (unspecified)                                                        */
#define PDM133_EASYDMAFULLLPMODEINCLUDED 0           /*!< (unspecified)                                                        */
#define PDM133_EASYDMAPATTERNMATCHERINCLUDED 0       /*!< (unspecified)                                                        */
#define PDM133_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                   */
#define PDM133_EASYDMASTOPTASKINCLUDED 1             /*!< (unspecified)                                                        */


#ifdef __cplusplus
}
#endif
#endif /* NRF7140_DPPR_PERIPHERALS_H */

